In [1]:
import pandas as pd

In [2]:
data = [10, 20, 30, 40]
ser = pd.Series(data)
print(ser)

0    10
1    20
2    30
3    40
dtype: int64

In [3]:
data = {
    "Name": ["Amit", "Priya", "Raj"],
    "Age": [25, 30, 28]
}

df = pd.DataFrame(data)
print(df)

    Name  Age
0   Amit   25
1  Priya   30
2    Raj   28

In [4]:
stu = {
    "Student": ["John", "Bob", "Marc"],
    "Maths": [76, 66, 78],
    "Science": [72, 52, 82],
    "English": [78, 88, 98]
}
df = pd.DataFrame(stu)
print(df)

  Student  Maths  Science  English
0    John     76       72       78
1     Bob     66       52       88
2    Marc     78       82       98

In [5]:
# Use the student marks DataFrame from the previous project.
# First 2 rows display karo (head() use karke).
# Data ke structure aur data types ko check karo (info()).
# Marks ka statistical summary nikal ke print karo (describe()).

print(df.head(2))

df.info()

df.describe()

  Student  Maths  Science  English
0    John     76       72       78
1     Bob     66       52       88
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Student  3 non-null      object
 1   Maths    3 non-null      int64
 2   Science  3 non-null      int64
 3   English  3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 228.0+ bytes

           Maths    Science  English
count   3.000000   3.000000      3.0
mean   73.333333  68.666667     88.0
std     6.429101  15.275252     10.0
min    66.000000  52.000000     78.0
25%    71.000000  62.000000     83.0
50%    76.000000  72.000000     88.0
75%    77.000000  77.000000     93.0
max    78.000000  82.000000     98.0

In [6]:
data = {
    "Student": ["John", "Bob", "Marc"],
    "Maths": [76, 66, None],  # None = Missing value
    "Science": [72, None, 82],
    "English": [78, 88, 98]
}

df = pd.DataFrame(data)

print(df.isnull())
print("\nMissing values count per column:")
print(df.isnull().sum())

df_dropped = df.dropna()
print("\nData after dropping missing values:")
print(df_dropped)

df_fill = df.fillna(0)
print("\nData after filling missing values with 0:")
print(df_fill)
df_fill

   Student  Maths  Science  English
0    False  False    False    False
1    False  False     True    False
2    False   True    False    False

Missing values count per column:
Student    0
Maths      1
Science    1
English    0
dtype: int64

Data after dropping missing values:
  Student  Maths  Science  English
0    John   76.0     72.0       78

Data after filling missing values with 0:
  Student  Maths  Science  English
0    John   76.0     72.0       78
1     Bob   66.0      0.0       88
2    Marc    0.0     82.0       98

  Student  Maths  Science  English
0    John   76.0     72.0       78
1     Bob   66.0      0.0       88
2    Marc    0.0     82.0       98

In [7]:
data_with_duplicates = {
    "Student": ["John", "Bob", "John"],
    "Maths": [76, 66, 76],
    "Science": [72, 52, 72],
    "English": [78, 88, 78]
}

df_dup = pd.DataFrame(data_with_duplicates)

print("\nDuplicate rows:")
print(df_dup.duplicated())

df_no_dup = df_dup.drop_duplicates()
print("\nData after removing duplicates:")
print(df_no_dup)

Duplicate rows:
0    False
1    False
2     True
dtype: bool

Data after removing duplicates:
  Student  Maths  Science  English
0    John     76       72       78
1     Bob     66       52       88

In [8]:
# Create a DataFrame with some missing values in the student marks data.
# Count the missing values for each column.
# Remove rows with missing values.
# Replace missing values with 0.
# Create another DataFrame with duplicate rows and remove duplicates.

In [9]:
d_p = {
    "Student": ["John", "Bob", "John"],
    "Maths": [76, None, 76],
    "Science": [72, 52, 72],
    "English": [78, 88, None]
}

d_practice = pd.DataFrame(d_p)

#print(d_practice.isnull().sum())

# drop_null = d_practice.dropna()
# print(drop_null)

fill_null = d_practice.fillna(0)
print(fill_null)

  Student  Maths  Science  English
0    John   76.0       72     78.0
1     Bob    0.0       52     88.0
2    John   76.0       72      0.0

In [10]:
data_duplicates = {
    "Student": ["John", "Bob", "John"],
    "Maths": [76, 66, 76],
    "Science": [72, 52, 72],
    "English": [78, 88, 78]
}

drop_d = pd.DataFrame(data_duplicates)

print("\nDuplicate rows:")
print(drop_d.duplicated())

print(drop_d.drop_duplicates())

Duplicate rows:
0    False
1    False
2     True
dtype: bool
  Student  Maths  Science  English
0    John     76       72       78
1     Bob     66       52       88

In [11]:
fil_data = {
    "Student": ["John", "Bob", "John"],
    "Maths": [76, 66, 76],
    "Science": [72, 52, 72],
    "English": [78, 88, 78]
}

filt_data = pd.DataFrame(fil_data)

df_filt = df[df["Maths"] < 70]
print(df_filt)

  Student  Maths  Science  English
1     Bob   66.0      NaN       88

In [12]:
# Filter: Un students ko filter karo jinka Science ka score 80 se zyada hai.
# Sort: Students ko Maths ke scores ke basis pe descending order me sort karo.
# Group: Group karo, aur average Maths aur Science score nikaalo.

In [19]:
filt_score = df[df["Science"] > 80]
print(filt_score)

d_s = df.sort_values(by='Maths', ascending=False)
d_s

d_g = df.groupby("Student")[["Maths","Science"]].mean()
print(d_g)

  Student  Maths  Science  English
2    Marc    NaN     82.0       98
         Maths  Science
Student
Bob       66.0      NaN
John      76.0     72.0
Marc       NaN     82.0

In [15]:
mean_scores = df[["Maths","Science","English"]].mean()
print("Mean Scores for Each Subject:")
print(mean_scores)

Mean Scores for Each Subject:
Maths      71.0
Science    77.0
English    88.0
dtype: float64

In [16]:
maths_total = df["Maths"].sum()
print(maths_total)

142.0

In [20]:
grouping = df.groupby("Student")[["Maths","Science","English"]].mean()
print(grouping)

         Maths  Science  English
Student
Bob       66.0      NaN     88.0
John      76.0     72.0     78.0
Marc       NaN     82.0     98.0

In [22]:
multi_agg = df["Maths"].agg(["mean","sum","min","max"])
print(multi_agg)

mean     71.0
sum     142.0
min      66.0
max      76.0
Name: Maths, dtype: float64

In [24]:
# Aggregation Challenge
# Group karo students ko aur har subject ka average score nikaalo.
# Maths scores ka total aur maximum value nikaalo.
# Multiple aggregation functions (mean, min, max) Maths par apply karo.
# Try kar aur bata agar koi issue aaye! 😊

df_avg = df.groupby("Student")[['Maths','Science',"English"]].mean()
print(df_avg)

         Maths  Science  English
Student
Bob       66.0      NaN     88.0
John      76.0     72.0     78.0
Marc       NaN     82.0     98.0

In [26]:
df_to = df['Maths'].agg(['sum','max'])
print(df_to)

sum    142.0
max     76.0
Name: Maths, dtype: float64

In [27]:
df_total = df['Maths'].agg(['mean', 'min', 'max'])
print(df_total)

mean    71.0
min     66.0
max     76.0
Name: Maths, dtype: float64

In [28]:
df_lamb = df['Maths'].apply(lambda x: "High" if x > 80 else "Low")
print(df_lamb)

0    Low
1    Low
2    Low
Name: Maths, dtype: object

In [30]:
data1 = {
    "Student": ["John", "Bob", "Marc", "Anna", "Eve"],
    "Maths": [76, 66, 85, 92, 58],
    "Science": [72, 82, 80, 88, 65],
    "English": [78, 88, 89, 85, 72]
}

df = pd.DataFrame(data1)
print(df)

  Student  Maths  Science  English
0    John     76       72       78
1     Bob     66       82       88
2    Marc     85       80       89
3    Anna     92       88       85
4     Eve     58       65       72

In [37]:
# Perform Sorting.
# Filter Students with Maths > 80.
# Add "Status" column based on Maths marks.
sortie = df.sort_values(by='Maths', ascending=False)
sortie

great = df[df['Maths'] > 80]
print(great)

df['Status'] = df['Maths'].apply(lambda x: "High" if x > 80 else "Low")
df

  Student  Maths  Science  English
2    Marc     85       80       89
3    Anna     92       88       85

  Student  Maths  Science  English Status
0    John     76       72       78    Low
1     Bob     66       82       88    Low
2    Marc     85       80       89   High
3    Anna     92       88       85   High
4     Eve     58       65       72    Low